app/controllers/account_controller.rb

	def authenticate

		@user = User.new(params[:userform]);
		valid_user = User.find(:first,:conditions => ["username = ? and password = ?", @user.username, @user.password])
---
SELECT * FROM "users" WHERE (username = 'blah' and password = 'blah') LIMIT 1

	def register

		@user = User.new(params[:userform]);

		if !@user.username.blank? and !@user.password.blank? and !@user.email.blank?
			if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password", "email") VALUES('2010-10-13 16:13:43', '2010-10-13 16:13:43', 'blahblah', 'blahblah', 'blahblah@sadlkjf')

	def myaccount

		if !session[:user_id] or session[:user_id] == "ANONYMOUS"
			redirect_to :action => 'login'
		else
			@user = User.find(:first,:conditions => ["username = ?", session[:user_id] ])
---
SELECT * FROM "users" WHERE (username = 'blah') LIMIT 1