app/controllers/survey_controller.rb

	def validate_survey
		@survey = Survey.new(params[:userform])
		@user = User.find(:first,:conditions => ["username = ?", session[:user_id]])
		@user.surveys << @survey
---
INSERT INTO "surveys" ("updated_at", "title", "published", "username", "description", "created_at") VALUES('2010-10-13 08:16:33', 'dfklajsdfkj', '0', 0, 'al;skdjflasjkdf', '2010-10-13 08:16:33')

	def addquestion
		@counter = 1
		@question = Question.new(params[:userform])
		@survey = Survey.find(:first, :conditions => ["title = ?", session[:survey_title]])

		if !params[:choice].blank? and !@question.description.blank?

			@survey.questions << @question
---
INSERT INTO "choices" ("updated_at", "description", "question_description", "created_at") VALUES('2010-10-13 09:06:59', 'asdfasdfasdfsdf', 'sdfasdfasdf', '2010-10-13 09:06:59')
INSERT INTO "questions" ("updated_at", "title", "question", "created_at") VALUES('2010-10-13 08:51:51', 'lkasdjflkjasdf', 'asdfasdfsdf', '2010-10-13 08:51:51')